Lesson_4/students_app/app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "second_name", "mark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "some second name"], ["second_name", "another one  second name"], ["mark", 12], ["created_at", "2017-10-29 13:02:52.751233"], ["updated_at", "2017-10-29 13:02:52.751233"]]
---
  def create
    Student.create(student_params)

UPDATE "students" SET "first_name" = ?, "second_name" = ?, "mark" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "some second name"], ["second_name", "another one  second name"], ["mark", 16], ["updated_at", "2017-10-29 13:06:49.120290"], ["id", 2]]
---
  def update
    @student.update(student_params)