Lesson_4/films_app/app/controllers/films_controller.rb

  def index
    @films = Film.all
---
SELECT "films".* FROM "films"

  def create
    Film.create(film_params)
---
INSERT INTO "films" ("name", "year", "producer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "The Dark Tower"], ["year", 2017], ["producer", "Nikolay Arsel"], ["created_at", "2017-10-29 11:15:15.977141"], ["updated_at", "2017-10-29 11:15:15.977141"]]

  def update
    Film.update(film_params)
---
UPDATE "films" SET "name" = ?, "year" = ?, "producer" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["name", "vffffffffffff"], ["year", 4444], ["producer", "vvvvvvvvv"], ["updated_at", "2017-10-29 13:09:56.060634"], ["id", 1]]

  def destroy
    @films.destroy
---
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 2]]

  def find_film
    @films = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]